<?php
error_reporting(E_ALL & ~E_NOTICE);
session_start();

// ห้ามกำหนดตัวแปร $ls เด็ดขาด (ls คือ local server)
   $ls['host'] = "localhost";
   $ls['user'] = "root";
   $ls['pass'] = "usbw";
   $ls['db'] = "rrs";
   $ls['charset'] = "utf8";

// ตัวแปร rs คือ remote server เป็น server ของ ilib
   $rs['host'] = "localhost";
//   $rs['host'] = "202.28.32.113";
   $rs['user'] = "root";
//   $rs['user'] = "root";
   $rs['pass'] = "usbw";
//   $rs['pass'] = "spjrsr2002";
   $rs['db'] = "signon";
   $rs['charset'] = "tis620";
   
   header('Content-type: text/html; charset=utf-8');
   $thaiDaysName = array(1=>'จันทร์',2=>'อังคาร',3=>'พุธ',4=>'พฤหัสบดี',5=>'ศุกร์',6=>'เสาร์',7=>'อาทิตย์' );
   $thaiDaysNameShort = array(1=>'จ',2=>'อ',3=>'พ',4=>'พฤ',5=>'ศ',6=>'ส',7=>'อา' );
   $thaiMonthName = array(1=>'มกราคม',2=>'กุมภาพันธ์',3=>'มีนาคม',4=>'เมษายน',5=>'พฤษภาคม',6=>'มิถุนายน',7=>'กรกฏาคม',8=>'สิงหาคม',9=>'กันยายน',10=>'ตุลาคม',11=>'พฤศจิกายน',12=>'ธันวาคม' );
   $thaiMonthNameShort = array(1=>'ม.ค.',2=>'ก.พ.',3=>'มี.ค.',4=>'เม.ย.',5=>'พ.ค.',   6=>'มิ.ย.',7=>'ก.ค.',8=>'ส.ค.',9=>'ก.ย.',10=>'ต.ค.',11=>'พ.ย.',12=>'ธ.ค.' );
   $reserveTime = array(
      1=>'08:00-08:30',
      2=>'08:30-09:00',
      3=>'09:00-09:30',
      4=>'09:30-10:00',
      5=>'10:00-10:30',
      6=>'10:30-11:00',
      7=>'11:00-11:30',
      8=>'11:30-12:00',
      9=>'12:00-12:30',
      10=>'12:30-13:00',
      11=>'13:00-13:30',
      12=>'13:30-14:00',
      13=>'14:00-14:30',
      14=>'14:30-15:00',
      15=>'15:00-15:30',
      16=>'15:30-16:00',
      17=>'16:00-16:30',
      18=>'16:30-17:00'
   );

   date_default_timezone_set("Asia/Bangkok");
   
   $admin = array(
      'อภิชัย ไสยรส'
   );
?>